# PointCloudType Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudType Class
Members See Also
---
Represents a type of point cloud loaded into a Revit document. Each PointCloudType maps to a single file or identifier (depending upon the type of Point Cloud Engine which governs it).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class PointCloudType : ElementType
```

Visual Basic
---
```text
Public Class PointCloudType _
	Inherits ElementType
```

Visual C++
---
```text
public ref class PointCloudType : public ElementType
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..ElementType Autodesk.Revit.DB..::..PointCloudType
# See Also
PointCloudType Members
Autodesk.Revit.DB Namespace